package com.example.behnam.myapplication;

import com.example.behnam.myapplication.objects.Drug;

import java.util.ArrayList;


public class druges_old {
    static private druges_old instance;
    private ArrayList<Drug> d_list = new ArrayList<>();

    public druges_old() {
        Drug d;
        {
            d = new Drug();
            d.setDrug_code("Antiplatelet");
            d.setDrug_name("عوامل ضد پلاکت");
            d.setDrug_describe("داروهای این دسته کاهش دهنده واقعی خطر هستند( شاید مهمترین قرص هایی که بعد از حمله قلبی مصرف میکنید این ها باشند).\n" +
                    "آسپرین معمول ترین دارویی است که باعث کاهش چسبندگی پلاکت های خونی میشود. این دارو احتمالا تشکیل لخته های خونی را کاهش و بیماری های شریانی را متوقف میکند.\n" +
                    "خوردن یک آسپرین در روز خطر حمله قلبی یا سکته را بطور قابل توجهی کاهش میدهد. این اثر در دوزهای پایین اتفاق می افتد. عوارض جانبی این دارو در دوز های پایین نادر است مگر در افرادی که مشکل معده دارند.\n" +
                    "•\tآسپرین 80 میلی گرمی را بایستی صبح قبل از صبحانه خورد. مقدار آنرا زیاد نکنید زیرا مزیتی ندارد.\n" +
                    "•\tاگر مشکل معده داشته باشید ممکن است به قرصی دیگر نیز در جهت محافظت از معده در مقابل آسپرین نیاز داشته باشید.\n" +
                    "•\tاگر با خوردن آسپرین دچارآلرژی یا مشکلاتی مثل آسم می شوید، داروی جایگزین مثل کلوپیدوگرل به شما توصیه میشود. بیشتر اوقات کلوپیدوگرول به همراه آسپرین بعد از حمله قلبی استفاده می شود.\n" +
                    "نمونه های عوامل ضد پلاکت:\n" +
                    "1-\tکلوپیدوگرول \n" +
                    "2-\tآسپرین \n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("Bata-blockers");
            d.setDrug_name("بتابلوکرها");
            d.setDrug_describe("این دارو ها، دیگر کاهنده های خطر خصوصا در طی سال اول بعد از حمله قلبی هستند. آنها همچنین برای کنترل علائمی مثل آنژین استفاده می شوند. این دارو ها اثرات آدرنالین را متوقف می کنند و ضربان قلب (کار سنگین عضلات قلب) را کاهش می دهند.\n" +
                    "اسامی شیمیایی بتا بلوکرها معمولا به الول(olol) ختم می شود. مثل: \n" +
                    "1-\tآتنولول \n" +
                    "2-\tبیزوپرولول\n" +
                    "3-\tمتروپرولول\n" +
                    "4-\tکارودیلول\n" +
                    "عوارض جانبی آنها می تواند شامل: خستگی، سردی انگشتان دست و پا، وز وز گوش(در بیماران دچار آسم معمولا نباید استفاده شوند)، کابوس های شبانه و مشکلات جنسی باشد. بیشتر این عوارض را میتوان با کاهش دوز دارو یا تغییر نوع بتابلوکر، البته بعد از مشورت با پزشک معالج برطرف نمود.\n" +
                    "•\tنباید مصرف بتابلوکر هارا به طور ناگهانی متوقف نمود، چرا که باعث آنژین شدید می شود." +
                    "" +
                    "" +
                    "\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("Statins");
            d.setDrug_name("استاتین ها");
            d.setDrug_describe("این دارو ها نیز، از دیگر کاهش دهنده های خطر هستند.\n" +
                    "همانطور که میدانید کلسترول بالا یک فاکتور خطر برای بیماری های قلبی عروقی است. در اکثر بیماران، کاهش سطح کلسترول خون احتمال حمله قلبی مجدد را کاهش می دهد. \n" +
                    " این داروها باعث کاهش التهاب عروق می شوند که اثری غیر وابسته به اثر کاهش دهنده کلسترول خون است.این دارو ها استاتین نام دارند.\n" +
                    "استاتین ها موجب کاهش سنتز کلسترول در کبد شما می شوند.\n" +
                    "نمونه هایی از استاتین ها: \n" +
                    "1-\tسیمو استاتین  \n" +
                    "2-\tآتورواستاتین\n" +
                    "3-\tرزوواستاتین\n" +
                    "این دارو ها خیلی سریع دست به کار میشوند و طی چند هفته خطر را کاهش می دهند.\n" +
                    "عوارض جانبی آنها می تواند شامل خستگی، درد عضلانی، ناراحتی معده و سردرد باشد.\n" +
                    "•\tآزمایشات خونی بایستی در جهت بررسی اثر دارو روی سطح کلسترول شما انجام شود. گهگاه این دارو ها می توانند باعث التهاب در عضلات یا کبد شوند. این اثر ممکن است در آزمایشات خونی مشخص شود. که بایستی نوع دارو را عوض کرد.\n" +
                    "•\tهرگونه درد عضلانی را فورا به پزشکتان گزارش دهید، چرا که ممکن است اولین نشانه از یک عارضه جانبی جدی باشد.\n" +
                    "•\tچنانچه شما قادر به مصرف استاتین ها نیستید یا اینکه آنها برای شما مفید نیستند، پزشکتان ممکن است دیگر داروهای کاهش دهنده کلسترول مثل ازتیمایب را برایتان تجویز کند.\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("ACE & ARB's");
            d.setDrug_name("مهار کننده های آنزیم تبدیل کننده آنژیوتانسین و بلاک کننده های گیرنده آنژیوتانسین  ");
            d.setDrug_describe("این نوع داروها  نیز می توانند خطر حمله قلبی را کاهش دهند. این دارو ها عروق خونی را گشاد می کنند و موجب کاهش فشار خون می شوند.\n" +
                    "بعد از یک حمله قلبی آنها می توانند عمل پمپاژ قلب را بهبود بخشند.این کار به رفع خستگی و نفس نفس زدن و به طور ساده به رفع پروسه صدمه کمک می کنند.\n" +
                    "اسامی شیمیایی مهار کننده های ACE  معمولا به پریل(pril) ختم می شود. نمونه هایی از مهار کننده های ACE :\n" +
                    "1-\tلیزینوپریل \n" +
                    "2-\tکاپتوپریل\n" +
                    "3-\tانالاپریل\n" +
                    "از عوارض جانبی آنها میتوان به سرگیجه هنگام ایستادن، سرفه خشک و اختلال در حس چشایی اشاره کرد.\n" +
                    "اگر شما قادر به مصرف مهارکننده ACE نیستید، بایستی بلاک کننده رسپتور آنژیوتانسین استفاده کنید.\n" +
                    "اسامی شیمیایی بلاک کننده های رسپتور آنژیوتانسین معمولا به زارتان ختم می شود. شامل:\n" +
                    "1-\tلوزارتان  \n" +
                    "2-\tوالزارتان.\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("Nitrates");
            d.setDrug_name("نیترات ها");
            d.setDrug_describe("•\tاین دارو ها برای کنترل آنژین استفاده می شوند.\n" +
                    "•\t نیترات ها موجب گشاد شدن عروق خونی\u200Cای که خون را به قلب میبرند می شوند. این عمل باعث کاهش مقدار خون برگشتی به قلب می شود و در نتیجه قلب کار کمتری انجام می دهد.\n" +
                    "•\tهمچنین نیترات ها ممکن است بویژه شریان کرونری را گشاد کنند که ارسال خون به عضله قلبی را بهبود می بخشد.\n" +
                    "هنگام ترک بیمارستان ممکن است به شما یک اسپری گلیسریل\u200Cتری\u200Cنیترات (TNG) کوتاه اثر داده شود، که بایستی در هنگام درد قفسه سینه، زیر زبانتان اسپری کنید. درصورت نیاز به اسپری بایستی دستور مصرف آن نیز برای شما توضیح داده شود.\n" +
                    "توصیه معمول این است که:\n" +
                    "•\tاسپری را استفاده کنید و به مدت ۵ دقیقه صبر کنید.\n" +
                    "•\tاگر هنوز درد دارید، دوز را تکرار کنید و ۵ دقیقه دیگر صبر کنید. \n" +
                    "•\tچنانچه دردتان همچنان ادامه داشت، یکبار دیگر هم می توانید این کار را انجام دهید.\n" +
                    "•\tاگر درد شما غیر قابل تحمل بود یا اگر بعد از ۱۵ دقیقه همچنان درد شما ادامه داشت یا اگر درد در طول این زمان بیشتر و بدتر شد با شماره 115 یا شماره اورژانس محلتان تماس بگیرید و درخواست آمبولانس دهید و به آنها بگویید که به حمله قلبی مشکوک هستید.\n" +
                    "اگر آنژین دارید، ممکن است برای پیشگیری از حمله مجدد قلبی، تری\u200Cنیترو\u200Cگلیسرین (TNG) تجویز شود. میتوانید صفحه ………… را که درمورد توصیه های کنترل آنژین میباشد، مطالعه فرمایید.\n" +
                    "انواع دیگری از TNG  وجود دارد که شامل قرص های کوتاه اثر  و بلند اثر هستند. مانند:\n" +
                    "1.\tایزوسوربایددی نیترات  \n" +
                    "2.\tایزوسوربایدمونو نیترات  \n" +
                    "عوارض جانبی آنها می تواند شامل سرگیجه هنگام ایستادن و سردرد باشد. البته سردرد بعد از چند هفته از شروع دارو از بین می رود.\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("Calcium channel blockers");
            d.setDrug_name("بلوک کننده های کانال کلسیم");
            d.setDrug_describe("این دارو ها برای درمان آنژین یا فشار خون بالا و گاهی برای تپش قلب یا اختلالات ریتمیک قلبی استفاده می شوند.\n" +
                    "این داروها نیز مانند نیترات ها، عروق خونی را گشاد می کنند آنها  فشار خون را کاهش می دهند. همچنین شریانهای کرونری را گشاد می کنند که منجر میشود به افزایش جریان خون عضلات قلب. در بعضی موارد این داروها عضله قلب را آرام کرده و ضربان قلب را آهسته می کنند.\n" +
                    "نمونه هایی از بلوک کننده های کانال کلسیم :\n" +
                    "1.\tآملودیپین \n" +
                    "2.\tدیلتیازم \n" +
                    "3.\tوراپامیل\n" +
                    "عوارض جانبی این دارو ها نیز شامل برافروختگی صورت، حالت تهوع، ورم مچ پا، یبوست و سردرد می باشد.\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("Potassium-channel activators");
            d.setDrug_name("فعال کننده های کانال پتاسیم");
            d.setDrug_describe("این دارو ها نیز برای درمان آنژین بکار می روند. آن ها شریان ها و ورید ها را گشاد می کنند و بار قلب را کاهش می دهند. همچنین شریان های کوچک قلبی را گشاد می کنند و در نتیجه به بهبود ارسال خون به عضله قلب کمک می کنند.\n" +
                    "نمونه ای از این گروه \n" +
                    "•\tنیکوراندیل \n" +
                    "از عوارض جانبی میتوان به سرگیجه در حالت ایستاده، سردرد، حالت تهوع و بر افروختگی صورت اشاره کرد.\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("مدرها");
            d.setDrug_name("دیورتیک ها(مدرها)");
            d.setDrug_describe("این داروها برای دفع آب اضافی تولید شده در بدن بعد از یک حمله قلبی که می\u200Cتواند منجر به تورم مچ پا یا نفس نفس زدن شود،استفاده می شوند.\n" +
                    "بعضی از مدرها برای درمان فشار خون بالا استفاده می شوند.\n" +
                    "درواقع مدرها، روی کلیه های شما و تولید ادرار بیشتر اثر می گذارند.\n" +
                    "نمونه هایی از این گروه : \n" +
                    "1.\tفوروزماید \n" +
                    "2.\tهیدروکلروتیازید\n" +
                    "3.\tمتولازون\n" +
                    "4.\tتریامترن-H\n" +
                    "عوارض جانبی این دارو ها شامل احساس خستگی یا ضعف و مشکلات جنسی است.\n" +
                    "شما بایستی مصرف غذاهای شور مثل  پنیر نمکی ، چیپس ، بادام زمینی نمکی و... کاهش دهید. چراکه این ها احساس مایع در بدن را افزایش می دهند.\n" +
                    "از آنجایی که دیورتیک ها کار کلیه هارا بیشتر می کنند،در طی مصرف این داروها بایستی گهگاهی تست های خونی جهت بررسی عملکرد آن ها زیر نظر پزشک انجام داد.\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("");
            d.setDrug_name("آنتی اریتمی ها ");
            d.setDrug_describe("بعضی بیماران برای درمان اختلالات ریتمیک قلبی به دارو نیاز دارند.این دارو ها به عنوان آنتی\u200Cآریتمی شناخته می شوند.\n" +
                    "متخصص قلب شما در مورد مدت زمان مصرف این دارو ها راهنمایی می کند.\n" +
                    "نمونه هایی از آنتی آریتمی ها شامل: \n" +
                    "1.\tدیگوکسین \n" +
                    "2.\tآمیودارون \n" +
                    "3.\tوراپامیل\n" +
                    " این دارو ها بسیار باهم تفاوت دارند،بنابراین حتما بروشور اطلاعاتی آنها برای چک کردن عوارض جانبی را مطالعه کنید.\n" +
                    "ضد انعقاد هایی مانند وارفارین،جهت رقیق کردن خون استفاده می شوند بنابراین خون به راحتی منعقد نمی شود.\n" +
                    "درصورت داشتن لکه های خونی در ورید ها یا داخل قلب (بویژه اگر مشکلاتی در ریتم قلب بلافاصله بعد از حمله قلبی داشتید) داروهای ضد انعقاد برای درمان کوتاه مدت بعد از حمله قلبی بایستی تجویز شوند.\n" +
                    "درصورت داشتن مشکلات مداوم در ریتم قلب یا حجم داخل قلب، نیاز به مصرف مادام\u200Cالعمر ضدانعقاد ها می باشد.\n" +
                    "عوارض جانبی وارفارین می\u200Cتواند خطرناک باشد، که به علت رقیق شدن بیش از اندازه خون می باشد و منجر به خون مردگی زیر پوستی یا خونریزی می شود.\n" +
                    "چنانچه وارفارین استفاده می\u200Cکنید،ممکن است متوجه ظهور سریع کبودی یا خونریزی طولانی شده باشید. ولی درصورت بدتر شدن ناگهانی این علائم بایستی با پزشک خود تماس بگیرید.\n" +
                    "در طول مصرف این دارو باید آزمایشات منظم خون انجام شود تا از دوز صحیح دارو مطمئن شویم و درصورت نیاز به مصرف داروی دیگر همزمان با وارفارین ممکن است نیاز به تنظیم دوز وارفارین باشد.\n" +
                    "قبل از خوردن انواع داروهای بدون نسخه(OTC) مثل داروهای گیاهی، حتما با پزشک یا داروساز مشورت کنید.چراکه تقریبا تمام ااین ها با وارفارین تداخل اثر دارند.\n");
            getD_list().add(d);
        }
        {
            d = new Drug();
            d.setDrug_code("مکمل های روغن ماهی");
            d.setDrug_name("مکمل های روغن ماهی");
            d.setDrug_describe("مکمل های روغن ماهی برای افرادی که نمی توانند ماهی را به طور مرتب بعد از حمله قلبی استفاده کنند، مفید است. یک گرم مکمل روغن ماهی مثل اُماکور(OMACOR)را توصیه می کنند که شامل ایکوزاپنتانوئیک اسید(EPA) و دوکوزاهگزانوئیک اسید(DHA) می\u200Cباشد. \n" +
                    "•\tاین مکمل ها در افرادی که وارفارین مصرف می کنند بهتر است استفاده نشود. چون ریسک خونریزی را زیاد می کند.\n");
            getD_list().add(d);
        }
        {

            d = new Drug();
            d.setDrug_code("");
            d.setDrug_name("داروهای کاهنده قند خون");
            d.setDrug_describe("مکمل های روغن ماهی برای افرادی که نمی توانند ماهی را به طور مرتب بعد از حمله قلبی استفاده کنند، مفید است. یک گرم مکمل روغن ماهی مثل اُماکور(OMACOR) را توصیه می کنند که شامل ایکوزاپنتانوئیک اسید(EPA) و دوکوزاهگزانوئیک اسید(DHA) می\u200Cباشد. \n" +
                    "•\tاین مکمل ها در افرادی که وارفارین مصرف می کنند بهتر است استفاده نشود. چون ریسک خونریزی را زیاد می کند.\n");
            getD_list().add(d);
        }
        this.setInstance(this);
    }

    public static druges_old getInstance() {
        if (instance != null)
            return instance;
        else return new druges_old();
    }

    public static void setInstance(druges_old instance) {
        druges_old.instance = instance;
    }

    public ArrayList<Drug> getD_list() {
        return d_list;
    }

    public void setD_list(ArrayList<Drug> d_list) {
        this.d_list = d_list;
    }
}
